dinga1981/esp8266-ai/firmware/src/main.cpp
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS]; // top line (code + CJK name strip)
String stockLastVal[MAX_STOCKS];  // value line (price + pct)
unsigned long lastStockPollMs = 0;
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

// ---------- full-screen K-line market mode ----------
// This is a separate page from the four-row stock page above. Unlike the
// ESP32-C3 implementation, the ESP8266 does not reserve a permanent 32 KB
// frame buffer. It allocates the compressed frame only during an update,
// validates the entire envelope and CRC, draws one row at a time through the
// existing 480-byte rowBuf, then immediately releases the allocation.
const unsigned long MARKET_POLL_INTERVAL_MS = 1000;
const unsigned long MARKET_HTTP_TIMEOUT_MS = 2500;
const unsigned long MARKET_READ_TIMEOUT_MS = 1200;
const unsigned long MARKET_TOTAL_TIMEOUT_MS = 5000;
const size_t MARKET_PACKED_HEADER_BYTES = 20;
const size_t MARKET_PACKED_MAX_BYTES = 30 * 1024;
unsigned long lastMarketPollMs = 0;
uint64_t lastMarketFrameVersion = 0;
String lastMarketFrameSession;
bool marketAutoDwellKnown = false;
unsigned long marketAutoDwellMs = 0;

String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

void applyBrightness() {
  // analogWriteRange(100) is set in setup(), so the duty value is just the
  // inverted percentage (active LOW: 0 duty = always LOW = full on).
  analogWrite(TFT_BL, 100 - brightness);
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

bool validAutoCycleSeconds(int seconds) {
  return seconds == 5 || seconds == 10 || seconds == 30 || seconds == 60 || seconds == 120;
}

uint8_t selectedAutoPageCount() {
  uint8_t count = 0;
  for (uint8_t mode = MODE_CLAUDE; mode <= MODE_MARKET; ++mode) {
    if (autoPageMask & (1U << mode)) ++count;
  }
  return count;
}

DisplayMode autoPageAt(uint8_t selectedIndex) {
  uint8_t found = 0;
  for (uint8_t mode = MODE_CLAUDE; mode <= MODE_MARKET; ++mode) {
    if (!(autoPageMask & (1U << mode))) continue;
    if (found++ == selectedIndex) return (DisplayMode)mode;
  }
  return MODE_CODEX;
}

void loadAutoCycle() {
  if (!LittleFS.exists(AUTO_CYCLE_FILE)) return;
  File f = LittleFS.open(AUTO_CYCLE_FILE, "r");
  if (!f) return;
  const int mask = f.readStringUntil('\n').toInt();
  const int seconds = f.readStringUntil('\n').toInt();
  f.close();
  const uint8_t allowedMask = ((1U << (MODE_MARKET + 1)) - 1U) & ~1U;
  if ((mask & allowedMask) != 0) autoPageMask = (uint8_t)(mask & allowedMask);
  if (validAutoCycleSeconds(seconds)) autoCycleSeconds = seconds;
}

void saveAutoCycle() {
  File f = LittleFS.open(AUTO_CYCLE_FILE, "w");
  if (!f) return;
  f.println(autoPageMask);
  f.println(autoCycleSeconds);
  f.close();
}

void resetAutoCyclePosition() {
  autoPageIndex = 0;
  autoPageStartedMs = millis();
}

void advanceAutoCycleIfNeeded(unsigned long nowMs) {
  if (displayMode != MODE_AUTO) return;
  const uint8_t count = selectedAutoPageCount();
  if (count == 0) return;
  unsigned long dwellMs = (unsigned long)autoCycleSeconds * 1000UL;
  if (autoPageAt(autoPageIndex) == MODE_MARKET) {
    // Give the bridge a short grace period to report its favorite count and
    // K-line rotation cadence. Once known, keep this page for one complete
    // favorite round instead of cutting it off at the outer page interval.
    if (!marketAutoDwellKnown && nowMs - autoPageStartedMs < 3000UL) return;
    if (marketAutoDwellKnown && marketAutoDwellMs > dwellMs) dwellMs = marketAutoDwellMs;
  }
  if (nowMs - autoPageStartedMs >= dwellMs) {
    autoPageIndex = (autoPageIndex + 1) % count;
    autoPageStartedMs = nowMs;
  }
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

