dinga1981/esp8266-ai/firmware/src/main.cpp
void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// Quota readout below the sprite: two columns ("5h" / "Wk"), small grey label
// over a big font-4 percentage. Values repaint only when their text changes
// (force = after a full-screen clear), so the 5s poll never flashes them.
const int QUOTA_LABEL_Y = 183, QUOTA_VALUE_Y = 199;
const int QUOTA_COL1_X = 70, QUOTA_COL2_X = 170;
String lastQuota5h, lastQuotaWk;

// pushImage() colors must be pre-byte-swapped (this firmware never enables
// setSwapBytes; see the sprite pipeline). Natural RGB565 -> wire order:
inline uint16_t swap565(uint16_t c) { return (uint16_t)((c << 8) | (c >> 8)); }

// ---- Nothing-phone-style dot-matrix font (NDot look) ----
// Every piece of ASCII text on the Claude/Codex quota pages renders as round
// dots on a fixed grid with visible gaps.
struct DotGlyph {
  char c;
  uint8_t w;
  uint8_t rows[7];
};

const DotGlyph dotGlyphs[] = {
    {'0', 5, {0b01110, 0b10001, 0b10011, 0b10101, 0b11001, 0b10001, 0b01110}},
    {'1', 5, {0b00100, 0b01100, 0b00100, 0b00100, 0b00100, 0b00100, 0b01110}},
    {'2', 5, {0b01110, 0b10001, 0b00001, 0b00010, 0b00100, 0b01000, 0b11111}},
    {'3', 5, {0b11111, 0b00010, 0b00100, 0b00010, 0b00001, 0b10001, 0b01110}},
    {'4', 5, {0b00010, 0b00110, 0b01010, 0b10010, 0b11111, 0b00010, 0b00010}},
    {'5', 5, {0b11111, 0b10000, 0b11110, 0b00001, 0b00001, 0b10001, 0b01110}},
    {'6', 5, {0b00110, 0b01000, 0b10000, 0b11110, 0b10001, 0b10001, 0b01110}},
    {'7', 5, {0b11111, 0b00001, 0b00010, 0b00100, 0b01000, 0b01000, 0b01000}},
    {'8', 5, {0b01110, 0b10001, 0b10001, 0b01110, 0b10001, 0b10001, 0b01110}},
    {'9', 5, {0b01110, 0b10001, 0b10001, 0b01111, 0b00001, 0b00010, 0b01100}},
    {'A', 5, {0b01110, 0b10001, 0b10001, 0b11111, 0b10001, 0b10001, 0b10001}},
    {'B', 5, {0b11110, 0b10001, 0b10001, 0b11110, 0b10001, 0b10001, 0b11110}},
    {'C', 5, {0b01110, 0b10001, 0b10000, 0b10000, 0b10000, 0b10001, 0b01110}},
    {'D', 5, {0b11110, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b11110}},
    {'E', 5, {0b11111, 0b10000, 0b10000, 0b11110, 0b10000, 0b10000, 0b11111}},
    {'F', 5, {0b11111, 0b10000, 0b10000, 0b11110, 0b10000, 0b10000, 0b10000}},
    {'G', 5, {0b01110, 0b10001, 0b10000, 0b10111, 0b10001, 0b10001, 0b01111}},
    {'H', 5, {0b10001, 0b10001, 0b10001, 0b11111, 0b10001, 0b10001, 0b10001}},
    {'I', 3, {0b111, 0b010, 0b010, 0b010, 0b010, 0b010, 0b111}},
    {'J', 5, {0b00111, 0b00010, 0b00010, 0b00010, 0b00010, 0b10010, 0b01100}},
    {'K', 5, {0b10001, 0b10010, 0b10100, 0b11000, 0b10100, 0b10010, 0b10001}},
    {'L', 5, {0b10000, 0b10000, 0b10000, 0b10000, 0b10000, 0b10000, 0b11111}},
    {'M', 5, {0b10001, 0b11011, 0b10101, 0b10101, 0b10001, 0b10001, 0b10001}},
    {'N', 5, {0b10001, 0b10001, 0b11001, 0b10101, 0b10011, 0b10001, 0b10001}},
    {'O', 5, {0b01110, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b01110}},
    {'P', 5, {0b11110, 0b10001, 0b10001, 0b11110, 0b10000, 0b10000, 0b10000}},
    {'Q', 5, {0b01110, 0b10001, 0b10001, 0b10001, 0b10101, 0b10010, 0b01101}},
    {'R', 5, {0b11110, 0b10001, 0b10001, 0b11110, 0b10100, 0b10010, 0b10001}},
    {'S', 5, {0b01111, 0b10000, 0b10000, 0b01110, 0b00001, 0b00001, 0b11110}},
    {'T', 5, {0b11111, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100}},
    {'U', 5, {0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b01110}},
    {'V', 5, {0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b01010, 0b00100}},
    {'W', 5, {0b10001, 0b10001, 0b10001, 0b10101, 0b10101, 0b10101, 0b01010}},
    {'X', 5, {0b10001, 0b10001, 0b01010, 0b00100, 0b01010, 0b10001, 0b10001}},
    {'Y', 5, {0b10001, 0b10001, 0b01010, 0b00100, 0b00100, 0b00100, 0b00100}},
    {'Z', 5, {0b11111, 0b00001, 0b00010, 0b00100, 0b01000, 0b10000, 0b11111}},
    {'d', 5, {0b00001, 0b00001, 0b01101, 0b10011, 0b10001, 0b10011, 0b01101}},
    {'h', 5, {0b10000, 0b10000, 0b10110, 0b11001, 0b10001, 0b10001, 0b10001}},
    {'k', 5, {0b10000, 0b10000, 0b10010, 0b10100, 0b11000, 0b10100, 0b10010}},
    {'s', 5, {0b00000, 0b00000, 0b01111, 0b10000, 0b01110, 0b00001, 0b11110}},
    {'%', 5, {0b11001, 0b11010, 0b00010, 0b00100, 0b01000, 0b01011, 0b10011}},
    {':', 1, {0b0, 0b0, 0b1, 0b0, 0b1, 0b0, 0b0}},
    {'.', 1, {0b0, 0b0, 0b0, 0b0, 0b0, 0b0, 0b1}},
    {',', 1, {0b0, 0b0, 0b0, 0b0, 0b0, 0b1, 0b1}},
    {'\'', 1, {0b1, 0b1, 0b0, 0b0, 0b0, 0b0, 0b0}},
    {'!', 1, {0b1, 0b1, 0b1, 0b1, 0b1, 0b0, 0b1}},
    {'?', 5, {0b01110, 0b10001, 0b00001, 0b00010, 0b00100, 0b00000, 0b00100}},
    {'-', 3, {0b000, 0b000, 0b000, 0b111, 0b000, 0b000, 0b000}},
    {'+', 3, {0b000, 0b010, 0b010, 0b111, 0b010, 0b010, 0b000}},
    {'/', 3, {0b001, 0b001, 0b010, 0b010, 0b010, 0b100, 0b100}},
    {' ', 2, {0b0, 0b0, 0b0, 0b0, 0b0, 0b0, 0b0}},
};

const DotGlyph *dotGlyph(char c) {
  for (const DotGlyph &g : dotGlyphs)
    if (g.c == c) return &g;
  if (c >= 'a' && c <= 'z') return dotGlyph(c - 32);
  return nullptr;
}

int dotCharAdv(char c, int pitch, int r) {
  const DotGlyph *g = dotGlyph(c);
  int w = g ? g->w : 3;
  return (w - 1) * pitch + 2 * r + 1 + pitch;
}

int dotTextWidth(const String &s, int pitch, int r) {
  if (s.length() == 0) return 0;
  int w = 0;
  for (unsigned int i = 0; i < s.length(); i++) w += dotCharAdv(s[i], pitch, r);
  return w - pitch;
}

int dotTextHeight(int pitch, int r) { return 6 * pitch + 2 * r + 1; }

void drawDotChar(char c, int x, int y, int pitch, int r, uint16_t color) {
  const DotGlyph *g = dotGlyph(c);
  if (!g) return;
  for (int ry = 0; ry < 7; ry++)
    for (int cx = 0; cx < g->w; cx++)
      if (g->rows[ry] & (1 << (g->w - 1 - cx))) {
        if (r <= 0) tft.drawPixel(x + r + cx * pitch, y + r + ry * pitch, color);
        else tft.fillCircle(x + r + cx * pitch, y + r + ry * pitch, r, color);
      }
}

void drawDotText(const String &s, int x, int y, int pitch, int r, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    drawDotChar(s[i], x, y, pitch, r, color);
    x += dotCharAdv(s[i], pitch, r);
  }
}

void drawDotTextC(const String &s, int cx, int y, int pitch, int r, uint16_t color) {
  drawDotText(s, cx - dotTextWidth(s, pitch, r) / 2, y, pitch, r, color);
}

int sqCharAdv(char c, int pitch, int d) {
  const DotGlyph *g = dotGlyph(c);
  int w = g ? g->w : 3;
  return (w - 1) * pitch + d + pitch;
}

int sqTextWidth(const String &s, int pitch, int d) {
  if (s.length() == 0) return 0;
  int w = 0;
  for (unsigned int i = 0; i < s.length(); i++) w += sqCharAdv(s[i], pitch, d);
  return w - pitch;
}

