dinga1981/esp8266-ai/firmware/src/main.cpp
// ---------- stock watchlist screen ----------

bool handleStockPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  JsonArray arr = doc["stocks"];
  stockCount = 0;
  for (JsonObject s : arr) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = s["code"] | "";
    stocks[stockCount].price = s["price"] | "";
    stocks[stockCount].pct = s["pct"] | "";
    stocks[stockCount].up = s["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

// Streams the Mac-rendered name strips and blits one per row (top line,
// right of the ASCII code). Wired-only mode has no HTTP: codes still show.
bool drawStockNames() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock/names.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t cnt = 0;
  if (stream->readBytes(&cnt, 1) != 1) {
    http.end();
    return false;
  }
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  bool ok = true;
  for (int i = 0; i < cnt && ok; i++) {
    int y0 = 10 + i * 54;
    for (int r = 0; r < STOCK_NAME_H; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      if (i < stockCount) tft.pushImage(70, y0 + r, STOCK_NAME_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void pollStock() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleStockPayload(http.getString());
  http.end();
}

// 54px per row: small grey code on top, big font-4 price (white) on the left
// and change% on the right - red rising / green falling (CN convention).
// Rows repaint only when their text changes, same trick as everywhere else.
void drawStockScreen() {
  if (!stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    for (int i = 0; i < MAX_STOCKS; i++) {
      stockLastCode[i] = "\x01"; // force repaint
      stockLastVal[i] = "\x01";
    }
    stockNamesDrawnRev = -1;
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 228, 1);
  }
  stockDirty = false;

  if (stockCount == 0) {
    if (stockLastCode[0] != "") {
      for (int i = 0; i < MAX_STOCKS; i++) {
        stockLastCode[i] = "";
        stockLastVal[i] = "";
      }
      tft.fillRect(0, 0, SCREEN_W, 226, TFT_BLACK);
      tft.setTextDatum(TC_DATUM);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(stockEverLoaded ? "No stocks configured" : "Waiting for bridge...", SCREEN_CX, 100, 2);
      if (stockEverLoaded) tft.drawString("Mac menu: Set watchlist", SCREEN_CX, 124, 2);
    }
    return;
  }

  for (int i = 0; i < MAX_STOCKS; i++) {
    int y0 = 10 + i * 54;
    bool has = i < stockCount;
    // top line (code + name strip) and value line refresh independently, so
    // a price tick never wipes the name bitmap
    String codeKey = has ? stocks[i].code : "";
    if (codeKey != stockLastCode[i]) {
      stockLastCode[i] = codeKey;
      tft.fillRect(0, y0, SCREEN_W, 17, TFT_BLACK);
      stockNamesDrawnRev = -1; // strip area wiped: re-fetch names
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(0x7BEF, TFT_BLACK);
        tft.drawString(stocks[i].code, 14, y0, 2);
      }
    }
    String valKey = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (valKey != stockLastVal[i]) {
      stockLastVal[i] = valKey;
      tft.fillRect(0, y0 + 18, SCREEN_W, 36, TFT_BLACK); // value line + inter-row gap
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 14, y0 + 18, 4);
        uint16_t pc = stocks[i].up > 0 ? TFT_RED : (stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(pc, TFT_BLACK);
        tft.drawString(stocks[i].pct, 226, y0 + 18, 4);
      }
    }
  }

  // CJK name strips, re-fetched when the watchlist (names_rev) changes
  if (stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev) {
    if (drawStockNames()) stockNamesDrawnRev = stockNamesRev;
  }
}

// ---------- full-screen K-line frame ----------

bool readMarketExact(WiFiClient *stream, uint8_t *dst, size_t length,
                     unsigned long timeoutMs) {
  size_t received = 0;
  unsigned long deadline = millis() + timeoutMs;
  while (received < length) {
    int available = stream->available();
    if (available > 0) {
      size_t want = min((size_t)available, length - received);
      int got = stream->read(dst + received, want);
      if (got > 0) {
        received += (size_t)got;
        continue;
      }
    }
    if ((long)(millis() - deadline) >= 0) return false;
    delay(1);
    yield();
  }
  return true;
}

uint32_t marketCrc32(const uint8_t *data, size_t length) {
  uint32_t crc = 0xFFFFFFFF;
  for (size_t i = 0; i < length; ++i) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ ((crc & 1U) ? 0xEDB88320U : 0U);
    }
  }
  return ~crc;
}

uint64_t marketReadU64BE(const uint8_t *data) {
  uint64_t value = 0;
  for (int i = 0; i < 8; ++i) value = (value << 8) | data[i];
  return value;
}

uint32_t marketReadU32BE(const uint8_t *data) {
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

// Validate every byte and the decoded pixel count before the TFT is touched.
// A short/corrupt/oversized download therefore leaves the prior page intact.
bool validateMarketFrame(const uint8_t *frame, size_t frameBytes,
                         uint64_t expectedVersion, uint64_t &versionOut) {
  if (frameBytes < MARKET_PACKED_HEADER_BYTES || memcmp(frame, "MKT1", 4) != 0) return false;
  const uint16_t width = ((uint16_t)frame[12] << 8) | frame[13];
  const uint16_t height = ((uint16_t)frame[14] << 8) | frame[15];
  if (width != SCREEN_W || height != SCREEN_H) return false;
  const uint64_t version = marketReadU64BE(frame + 4);
  if (version < expectedVersion || version <= lastMarketFrameVersion) return false;
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  if (marketCrc32(payload, payloadBytes) != marketReadU32BE(frame + 16)) return false;

  size_t cursor = 0, pixels = 0;
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    const size_t count = (control & 0x7F) + 1;
    const size_t encoded = (control & 0x80) ? 2 : count * 2;
    if (cursor + encoded > payloadBytes || pixels + count > SCREEN_W * SCREEN_H) return false;
    cursor += encoded;
    pixels += count;
  }
  if (pixels != SCREEN_W * SCREEN_H) return false;
  versionOut = version;
  return true;
}

void drawMarketFrame(const uint8_t *frame, size_t frameBytes) {
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  uint8_t *rowBytes = reinterpret_cast<uint8_t *>(rowBuf);
  size_t cursor = 0, rowPixels = 0;
  int y = 0;
  tft.startWrite();
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    size_t count = (control & 0x7F) + 1;
    const bool repeated = control & 0x80;
    uint8_t high = 0, low = 0;
    if (repeated) { high = payload[cursor++]; low = payload[cursor++]; }
    while (count-- > 0) {
      rowBytes[rowPixels * 2] = repeated ? high : payload[cursor++];
      rowBytes[rowPixels * 2 + 1] = repeated ? low : payload[cursor++];
      if (++rowPixels == SCREEN_W) {
        tft.pushImage(0, y++, SCREEN_W, 1, rowBuf);
        rowPixels = 0;
        yield();
      }
    }
  }
  tft.endWrite();
}

bool fetchMarketFrame(uint64_t expectedVersion, size_t advertisedBytes) {
  if (advertisedBytes < MARKET_PACKED_HEADER_BYTES ||
      advertisedBytes > MARKET_PACKED_MAX_BYTES) return false;
  // Leave enough contiguous heap for HTTP/TCP and the rest of the firmware.
  if (ESP.getMaxFreeBlockSize() < advertisedBytes + 6144) {
    Serial.printf("[market] insufficient heap frame=%u maxblock=%u\n",
                  (unsigned)advertisedBytes, ESP.getMaxFreeBlockSize());
    return false;
  }
  uint8_t *frame = (uint8_t *)malloc(advertisedBytes);
  if (!frame) return false;

