dinga1981/esp8266-ai/firmware/src/main.cpp
  WiFiClient client;
  client.setTimeout(MARKET_READ_TIMEOUT_MS);
  HTTPClient http;
  String url = "http://" + bridgeHost + "/market/frame.rle";
  http.setTimeout(MARKET_HTTP_TIMEOUT_MS);
  bool ok = false;
  if (http.begin(client, url)) {
    const int code = http.GET();
    const int actualBytes = http.getSize();
    if (code == HTTP_CODE_OK && actualBytes == (int)advertisedBytes) {
      WiFiClient *stream = http.getStreamPtr();
      if (readMarketExact(stream, frame, advertisedBytes, MARKET_TOTAL_TIMEOUT_MS)) {
        uint64_t version = 0;
        if (validateMarketFrame(frame, advertisedBytes, expectedVersion, version)) {
          drawMarketFrame(frame, advertisedBytes);
          lastMarketFrameVersion = version;
          ok = true;
          Serial.printf("[market] applied version=%llu bytes=%u heap=%u\n",
                        (unsigned long long)version, (unsigned)advertisedBytes,
                        ESP.getFreeHeap());
        }
      }
    }
    http.end();
  }
  free(frame);
  if (!ok) Serial.println("[market] frame rejected; keeping previous screen");
  return ok;
}

void pollMarket() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/market/version";
  http.setTimeout(MARKET_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  const int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return; }
  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, http.getString());
  http.end();
  if (err) return;
  const char *session = doc["session"] | "";
  const int favoriteCount = doc["favorite_count"] | 0;
  const int refreshSeconds = doc["refresh_seconds"] | 0;
  if (favoriteCount > 0 && favoriteCount <= 15 &&
      (refreshSeconds == 5 || refreshSeconds == 10 || refreshSeconds == 30 ||
       refreshSeconds == 60 || refreshSeconds == 120)) {
    marketAutoDwellMs = (unsigned long)favoriteCount * (unsigned long)refreshSeconds * 1000UL;
    marketAutoDwellKnown = true;
  }
  if (session[0] != '\0' && lastMarketFrameSession != session) {
    lastMarketFrameSession = session;
    lastMarketFrameVersion = 0;
  }
  const uint64_t version = doc["version"] | (uint64_t)0;
  const char *codec = doc["codec"] | "";
  const size_t packedBytes = doc["packed_bytes"] | (size_t)0;
  if (version > lastMarketFrameVersion &&
      strcmp(codec, "rgb565-packbits-v1") == 0) {
    fetchMarketFrame(version, packedBytes);
  }
}

// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  return true;
}

// The mode actually rendered. AUTO selects exactly one configured carousel
// page; the fixed-page modes keep their original behavior.
DisplayMode effectiveMode() {
  if (displayMode == MODE_AUTO) {
    const uint8_t count = selectedAutoPageCount();
    if (count == 0) return MODE_CODEX;
    if (autoPageIndex >= count) autoPageIndex = 0;
    return autoPageAt(autoPageIndex);
  }
  return displayMode;
}

bool selectEffectivePet(DisplayMode eff) {
  if (eff == MODE_CLAUDE) {
    const bool changed = currentApp != APP_CLAUDE;
    currentApp = APP_CLAUDE;
    return changed;
  }
  if (eff == MODE_CODEX) {
    const bool changed = currentApp != APP_CODEX;
    currentApp = APP_CODEX;
    return changed;
  }
  return updateActiveApp();
}

